### Экранирование значений параметров

Для объединения нескольких слов в параметре в одно можно использовать `"..."` (двойные кавычки) или, если что-то идёт не так `"'...'"` одинарные кавычки внутри двойных.

Экранирование кавычками может работать только на весь список параметров. Например:

Значением переменной будет одна неразрывная строка:
```
SET(FILE_LIST "a.x b.x c.x")
```

Значением переменной станет список из 4-х элементов, а не из 3-х:
```
SET(FILE_LIST a.x "with space.x" c.x)
```
Внутри ya make в качестве разделителя также используется запятая (`,`) и в некоторых случаях её невозможно надёжно экранировать. Единственным надёжным решением на данный
момент является использование специальной переменной `${__COMMA__}`

Пример:

```
SET(
  OPENAPI_GENERATOR_GENERATE_MODELS_VALUE
  models${__COMMA__}apis=false${__COMMA__}modelTests=false${__COMMA__}apiTests=false${__COMMA__}modelDocs=false${__COMMA__}apiDocs=false
)
```
